Repository: huixiangyang/arc-kit
Catalog: Sources/Application/Resources/Localization/WallpaperPlayback.xcstrings
Source language: en
Languages: zh_hans

# apply.disconnectedDuringWrite
source: Display disconnected
zh_hans: 屏幕已断开

# apply.display.disconnected
source: %1$@ (display disconnected)
zh_hans: %1$@（屏幕已断开）

# apply.originalUnavailable
source: %1$@ (original wallpaper missing or unreadable; restoration not attempted)
zh_hans: %1$@（原壁纸文件已不存在或不可读，未尝试写回）

# apply.restoration.request.failed
source: %1$@ (restoration request failed: %2$@)
zh_hans: %1$@（恢复请求失败：%2$@）

# apply.restoration.requested.awaiting.system.confirmation
source: Restoration requested; awaiting system confirmation
zh_hans: 已请求恢复，系统尚未确认

# apply.restoreUnconfirmed
source: Original wallpaper restoration unconfirmed: %1$@. Check macOS wallpaper settings.
zh_hans: 原壁纸恢复未完成确认：%1$@。请检查系统壁纸设置。

# apply.succeeded
source: Set “%1$@” as the %3$@ for %2$@.
zh_hans: 已将“%1$@”设为 %2$@ 的%3$@。

# apply.systemUnconfirmed
source: macOS accepted the wallpaper setting. Still unconfirmed: %1$@. Configuration saved; refresh Displays & Playback to check.
zh_hans: 系统已接受壁纸设置；仍待确认：%1$@。已保存配置，请在“屏幕与播放”刷新检查。

# apply.targetsDisconnected
source: Target displays disconnected: %1$@. No other displays were used.
zh_hans: 目标屏幕已断开：%1$@。未改为其他屏幕。

# apply.unavailable.set.wallpaper
source: Could not set wallpaper for %1$@: %2$@
zh_hans: %1$@ 的壁纸写入失败：%2$@

# desktop.debugScope
source: Debug windows do not change the desktop. Apply wallpapers in the installed app.
zh_hans: 调试窗口不修改桌面，请在安装版中应用壁纸。

# desktop.playbackFailed
source: Cannot play the live wallpaper.
zh_hans: 动态壁纸无法播放。

# desktop.target.display.disconnected
source: The target display is disconnected.
zh_hans: 目标屏幕已断开。

# desktop.unreadableFile
source: The wallpaper file cannot be read. Import it again.
zh_hans: 壁纸文件不可读取，请重新导入。

# desktop.video.loading.timeout.original.wallpaper
source: Video loading timed out. The original wallpaper is unchanged.
zh_hans: 视频加载超时，原壁纸未改变。

# desktop.video.playback.failed
source: Video playback failed
zh_hans: 视频播放失败

# display.applies.selected.displays.mirrored.displays
source: Applies only to selected displays. Mirrored displays follow the desktops provided by macOS.
zh_hans: 只应用到本次勾选的屏幕，其他屏幕保持原状。镜像模式按系统提供的桌面处理。

# display.apply.display
source: Apply to This Display
zh_hans: 应用到此屏幕

# display.apply.wallpaper
source: Apply Wallpaper
zh_hans: 应用壁纸

# display.applying.wallpaper
source: Applying wallpaper…
zh_hans: 正在应用壁纸…

# display.available.displays.missing
source: No available displays
zh_hans: 没有可设置的屏幕

# display.cancel.operation
source: Cancel Operation
zh_hans: 取消操作

# display.change
source: Change…
zh_hans: 更换…

# display.choose.displays
source: Choose Displays
zh_hans: 选择屏幕

# display.choose.wallpaper.display
source: Choose Wallpaper for Display
zh_hans: 为屏幕选择壁纸

# display.clear
source: Clear
zh_hans: 清空

# display.disconnected.display
source: Disconnected display %1$@
zh_hans: 未连接的屏幕 %1$@

# display.disconnected.displays
source: Disconnected displays
zh_hans: 未连接的屏幕

# display.display
source: Display %1$@, %2$@%3$@
zh_hans: 屏幕 %1$@，%2$@%3$@

# display.display.automatic.rotation.enabled.applying
source: This display has automatic rotation enabled. Applying manually does not turn rotation off.
zh_hans: 此屏幕正在自动轮换，手动应用不会关闭轮换。

# display.display.disconnected.reconnect
source: This display is disconnected. Reconnect it before applying.
zh_hans: 这块屏幕已断开，重新连接后才能应用。

# display.displays.wallpapers
source: Displays and Wallpapers
zh_hans: 屏幕与壁纸

# display.each.display.different.wallpaper
source: Each display can have a different wallpaper. Click the arrangement or Change to configure one display.
zh_hans: 各屏幕可使用不同壁纸。点击排列图或“更换”单独设置。

# display.import.files.my.wallpapers.download
source: Import files in My Wallpapers or download them from the online gallery.
zh_hans: 请先到“我的壁纸”导入文件，或从在线图库下载。

# display.keeps.configuration.restore.video.wallpaper
source: Keeps the configuration to restore video wallpaper when reconnected. Removing it does not delete library assets.
zh_hans: 保留配置以便重连后恢复视频壁纸；移除配置不删除图库素材。

# display.main.display
source: , main display
zh_hans: ，主屏幕

# display.matching.wallpapers.missing
source: No matching wallpapers
zh_hans: 没有匹配的壁纸

# display.noneAvailable
source: No available displays detected. Connect a display and try again.
zh_hans: 未检测到可设置的屏幕，请连接显示器后重试。

# display.remove.configuration
source: Remove Configuration
zh_hans: 移除配置

# display.removedAssignment
source: Removed the disconnected display's wallpaper configuration. Library files are preserved.
zh_hans: 已移除断开屏幕的壁纸配置，图库文件保留。

# display.rotation.still.enabled.selected
source: Rotation is still enabled for the selected displays and will change the wallpaper again on schedule.
zh_hans: 所选范围仍有自动轮换，下一次轮换会继续更换壁纸。

# display.scaling
source: Scaling
zh_hans: 显示方式

# display.scaling.display
source: Scaling for this display
zh_hans: 此屏幕显示方式

# display.search.my.wallpapers
source: Search my wallpapers
zh_hans: 搜索我的壁纸

# display.select.least.one.display
source: Select at least one display
zh_hans: 请选择至少一块屏幕

# display.selected.display.disconnected.deselect.continue
source: Selected display disconnected · Deselect it to continue
zh_hans: 所选屏幕已断开 · 取消勾选后可继续

# display.set.desktop.wallpaper
source: Set Desktop Wallpaper
zh_hans: 设置桌面壁纸

# display.unconfirmedAssignment
source: Configured; not confirmed active
zh_hans: 已配置，未确认生效

# display.use
source: In use
zh_hans: 正在使用

# display.using.system.wallpaper
source: Using system wallpaper
zh_hans: 使用系统壁纸

# display.wallpaper.unavailable
source: Wallpaper unavailable
zh_hans: 壁纸不可用

# display.wallpapers.yet.missing
source: No wallpapers yet
zh_hans: 还没有壁纸

# displays.selectedCount
source: %lld displays selected
zh_hans: 已选择 %lld 块屏幕

# interval.fifteenMinutes
source: 15 minutes
zh_hans: 15 分钟

# interval.fiveMinutes
source: 5 minutes
zh_hans: 5 分钟

# interval.hour
source: 1 hour
zh_hans: 1 小时

# interval.thirtyMinutes
source: 30 minutes
zh_hans: 30 分钟

# library.choose.one.more.displays.setting
source: Choose one or more displays when setting desktop wallpaper. Configure each display separately in Displays & Playback.
zh_hans: 设为桌面壁纸时可选择一块或多块屏幕，各屏幕也可在“屏幕与播放”中单独设置。

# library.display.reconnected.change.wallpaper
source: The display reconnected. Change its wallpaper in that display's settings.
zh_hans: 屏幕已重新连接，请在该屏幕的设置中更换壁纸。

# library.invalid.display.assignment.format
source: Invalid display assignment format
zh_hans: 屏幕分配格式错误

# library.live.wallpaper.playback.failed
source: Live wallpaper playback failed: %1$@
zh_hans: 动态壁纸播放失败：%1$@

# library.live.wallpapers.rotation.stopped.original
source: Live wallpapers and rotation stopped. The original system desktop is visible.
zh_hans: 动态壁纸与轮换已停止，显示系统原有桌面。

# library.main.display
source: · Main display
zh_hans: · 主屏幕

# library.rollbackFailed
source: Could not save wallpaper state. The original desktop was restored: %1$@
zh_hans: 保存壁纸状态失败，已恢复原桌面：%1$@

# library.saveFailed
source: Could not save wallpaper state: %1$@; %2$@
zh_hans: 保存壁纸状态失败：%1$@；%2$@

# playback.all.displays
source: All displays
zh_hans: 全部显示器

# playback.automatic.rotation
source: Automatic Rotation
zh_hans: 自动轮换

# playback.change.now
source: Change Now
zh_hans: 立即换一张

# playback.change.wallpaper.schedule
source: Change wallpaper on a schedule
zh_hans: 定时更换壁纸

# playback.debugScope
source: This debug session does not apply wallpapers or start rotation.
zh_hans: 此调试会话不会应用壁纸或启动自动轮换。

# playback.disconnected.displays
source: Disconnected displays
zh_hans: 已断开的显示器

# playback.favorites
source: Favorites only
zh_hans: 只轮换收藏

# playback.interval
source: Interval
zh_hans: 间隔

# playback.live.wallpaper.set.missing
source: No live wallpaper set
zh_hans: 未设置动态壁纸

# playback.pause
source: Pause
zh_hans: 暂停播放

# playback.resume
source: Resume
zh_hans: 继续播放

# playback.rotation.affects.selected.scope.all
source: Rotation affects only the selected scope. All displays switch to the same wallpaper together. Manually choosing displays does not change rotation scope. Rotation continues when the window closes and stops when Arc Kit quits.
zh_hans: 轮换只影响所选范围；全部屏幕会同步切换同一张壁纸。手动选屏不改变轮换范围。关闭管理窗口继续轮换，退出 Arc Kit 后停止。

# playback.rotation.displays
source: Rotation displays
zh_hans: 轮换屏幕

# playback.rotation.scaling
source: Rotation scaling
zh_hans: 轮换显示方式

# playback.shuffle
source: Shuffle
zh_hans: 随机顺序

# playback.supports.mp4.mov.m4v.silent
source: Supports MP4, MOV and M4V with silent looping. Pauses during sleep or an inactive user session. Stopping reveals the system wallpaper; quitting closes the video.
zh_hans: 支持 MP4、MOV、M4V，静音循环播放；休眠或用户会话停用时暂停。停止后显露系统原有壁纸，退出后视频关闭。

# playback.video.playback.all.displays
source: Video Playback · All Displays
zh_hans: 视频播放 · 全部屏幕

# playback.video.wallpaper.configured
source: Video wallpaper configured
zh_hans: 已配置视频壁纸
